<?php

// 通信元から送信されてきたパラメータを取得する。
$ent_json = $_POST['key1'];
$ent = json_decode($ent_json,true);//JSON文字を配列に戻す

$ent = _getEntity($ent['id']);

// テストエラー
if($ent['id'] == 3 || $ent['id'] == 4){
	throw new Exception('テストエラー');
}

if($ent['id'] == 7){
	sleep (4); // 4秒スリープ
}

// JSONに変換し、通信元に返す。
$json_str = json_encode($ent,JSON_HEX_TAG | JSON_HEX_QUOT | JSON_HEX_AMP | JSON_HEX_APOS);
echo $json_str;


function _getEntity($id){
	$data = [
			['id'=>1, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'アベサンショウウオ'],
			['id'=>2, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'アカイシサンショウウオ'],
			['id'=>3, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'ハクバサンショウウオ'],
			['id'=>4, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'ホクリクサンショウウオ'],
			['id'=>5, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'オオイタサンショウウオ'],
			['id'=>6, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'オオダイガハラサンショウウオ'],
			['id'=>7, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'オキサンショウウオ'],
			['id'=>8, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'カスミサンショウウオ'],
			['id'=>9, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'トウキョウサンショウウオ'],
			['id'=>10, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'ベッコウサンショウウオ'],
			['id'=>11, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'キタサンショウウオ'],
			['id'=>12, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'イシヅチサンショウウオ'],
			['id'=>13, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'クロサンショウウオ'],
			['id'=>14, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'コガタブチサンショウウオ'],
			['id'=>15, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'ツシマサンショウウオ'],
			['id'=>16, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'トウホクサンショウウオ'],
			['id'=>17, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'ヒダサンショウウオ'],
			['id'=>18, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'ブチサンショウウオ'],
			['id'=>19, 'type_a'=>'両生類', 'type_b'=>'サンショウウオ', 'name'=>'エゾサンショウウオ'],
			['id'=>20, 'type_a'=>'両生類', 'type_b'=>'オオサンショウウオ', 'name'=>'オオサンショウウオ'],
			['id'=>21, 'type_a'=>'両生類', 'type_b'=>'イモリ', 'name'=>'イボイモリ'],
			['id'=>22, 'type_a'=>'両生類', 'type_b'=>'イモリ', 'name'=>'アカハライモリ'],
			['id'=>23, 'type_a'=>'両生類', 'type_b'=>'イモリ', 'name'=>'シリケンイモリ'],
			['id'=>24, 'type_a'=>'両生類', 'type_b'=>'ヒキガエル', 'name'=>'ミヤコヒキガエル'],
			['id'=>25, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'アマミイシカワガエル'],
			['id'=>26, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'オキナワイシカワガエル'],
			['id'=>27, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'コガタハナサキガエル'],
			['id'=>28, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'オットンガエル'],
			['id'=>29, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'ナゴヤダルマガエル'],
			['id'=>30, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'ナミエガエル'],
			['id'=>31, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'ホルストガエル'],
			['id'=>32, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'アマミハナサキガエル'],
			['id'=>33, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'ハナサキガエル'],
			['id'=>34, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'ヤエヤマハラブチガエル'],
			['id'=>35, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'アマミアカガエル'],
			['id'=>36, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'オキタゴガエル'],
			['id'=>37, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'ヤクシマタゴガエル'],
			['id'=>38, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'トウキョウダルマガエル'],
			['id'=>39, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'チョウセンヤマアカガエル'],
			['id'=>40, 'type_a'=>'両生類', 'type_b'=>'アカガエル', 'name'=>'ツシマアカガエル'],
	];
	
	$ent2 = [];
	foreach($data as $ent){
		if($id == $ent['id']){
			$ent2 = $ent;
		}
	}
	return $ent2;
}